# 5. Реализуйте алгоритм перемешивания списка.
#  Без функции shuffle из модуля random.
# 10
# -> [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
# -> [0, 7, 6, 3, 4, 2, 9, 5, 1, 8]

num = int(input())
num_list = []

for i in range(1, num + 1):
    num_list.append(i - 1)
print(num_list)

#    не сдюжил!) на семинаре или в комметах 
#    расскажите решение плиз.
#    думаю через рекурсию, но не могу понять как)
#####

#####
